# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\ksoneda\Documents\PSoC Creator\Senior Design\AQM Firmware BLE\AQM Firmware BLE v1.cydsn\AQM Firmware BLE v1.cyprj
# Date: Fri, 03 Apr 2015 05:45:29 GMT
#set_units -time ns
create_clock -name {Clock_Counter(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_7}] [get_pins {ClockBlock/ff_div_8}] [get_pins {ClockBlock/ff_div_9}] [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {I2C_1_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {COZIR_SCBCLK(FFB)} -period 13020.833333333332 -waveform {0 6510.41666666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {Clock_Counter} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {I2C_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 31 61} [list]
create_generated_clock -name {COZIR_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 625 1251} -nominal_period 13020.833333333332 [list]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFCLK} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for C:\Users\ksoneda\Documents\PSoC Creator\Senior Design\AQM Firmware BLE\AQM Firmware BLE v1.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\ksoneda\Documents\PSoC Creator\Senior Design\AQM Firmware BLE\AQM Firmware BLE v1.cydsn\AQM Firmware BLE v1.cyprj
# Date: Fri, 03 Apr 2015 05:45:25 GMT
